W8D1/reddit_clone/app/views/posts/show.html.erb

<ul>
  <% @post.comments.where(parent_comment_id: nil).each do |top_level_comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."parent_comment_id" IS NULL  [["post_id", 1]]