W8D1/reddit_clone/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO "comments" ("content", "author_id", "post_id", "parent_comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "asdgags"], ["author_id", 1], ["post_id", 1], ["parent_comment_id", 1], ["created_at", "2021-03-09 00:02:06.065288"], ["updated_at", "2021-03-09 00:02:06.065288"]]