W8D1/reddit_clone/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Ramen"], ["url", ""], ["content", "I love Ramen!"], ["sub_id", 1], ["author_id", 1], ["created_at", "2021-03-08 21:51:43.308494"], ["updated_at", "2021-03-08 21:51:43.308494"]]

  def show
    @post = Post.find(params[:id])
    @all_comments = @post.comments.includes(:author)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]