W8D1/reddit_clone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Food"], ["description", "Foods"], ["moderator_id", 1], ["created_at", "2021-03-08 21:33:15.218856"], ["updated_at", "2021-03-08 21:33:15.218856"]]
---
  def create
    @sub = Sub.new(sub_params)
    if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def update
    @sub = Sub.find(params[:id])