W6D5/cat_99/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
  def index
    cats = Cat.all