W5D4/URLShortener/app/models/shortened_url.rb

SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "DLCwK7mm-mkNsd26sXUtzQ"], ["LIMIT", 1]]
---
  def self.random_code
    byte_code = SecureRandom.urlsafe_base64
    while ShortenedUrl.exists?(:short_url => byte_code)