W6D3/art_share_api/app/controllers/users_controller.rb

  def update
    user = User.find_by(id: params[:id])

    if user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "\"Jessica\""], ["email", "\"sarah@email.com\""], ["updated_at", "2021-02-25 21:46:01.006095"], ["id", 3]]

  def destroy
    user = User.find_by(id: params[:id])

    if user
      user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]