W7D2/music_app/app/models/user.rb

  def self.generate_session_token
    token = SecureRandom.urlsafe_base64(16)

    while self.class.exists?(session_token: token)
---
SELECT  1 AS one FROM "users" WHERE "users"."session_token" = $1 AND "users"."id" != $2 LIMIT $3  [["session_token", "YeJ6hQyp5Bmsa5O3YunXwA"], ["id", 4], ["LIMIT", 1]]