W8D1/reddit_clone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "6bD0gTXqgcocTBjzFDrguw=="], ["updated_at", "2021-03-08 18:57:48.821521"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = SecureRandom.base64
    self.save!