W8D1/reddit_clone/app/views/comments/_comment.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."parent_comment_id" = $2  [["post_id", 1], ["parent_comment_id", 1]]
---
<ul>
    <% parent_comment.post.comments.where(parent_comment_id: parent_comment.id).each do |child_comment| %>